#+OPTIONS: toc:nil

* Names scores

** Task

Using names.txt (right click and 'Save Link/Target As...'), a 46K text file
containing over five-thousand first names, begin by sorting it into alphabetical
order. Then working out the alphabetical value for each name, multiply this
value by its alphabetical position in the list to obtain a name score.

For example, when the list is sorted into alphabetical order, COLIN, which is
worth 3 + 15 + 12 + 9 + 14 = 53, is the 938th name in the list.
So, COLIN would obtain a score of 938 × 53 = 49714.

What is the total of all the name scores in the file?

** Solution

#+BEGIN_SRC python :results output :exports both
with open("names.txt", 'r') as f:
    raw = f.readlines()[0]

names = sorted([x.replace("\"", "") for x in raw.split(",")])
scores = []
for i in range(0, len(names)):
    score = 0
    for c in names[i]:
        score += ord(c.lower()) - ord('a') + 1
    scores.append(score * (i + 1))

print(sum(scores))
#+END_SRC

#+RESULTS:
: 871198282
